content/posts/introduction.md
+++
title = "Hello, world?"
author = ["peregrinator"]
date = 2022-11-21T00:00:00+05:30
lastmod = 2022-11-26T02:10:47+05:30
tags = ["intro", "about"]
draft = true
creator = "Emacs 29.0.50 (Org mode 9.5.5 + ox-hugo)"
toc = false
+++

I'm a 27 year old, non-binary, neurodivergent cat supremacist that
sometimes cosplays as an ecologist. I'm big on F(L)OSS and currently
run a [Void Linux](https://voidlinux.org) installation with a manually compiled version of
Emacs 29. I also play the guitar, typically listen to metal and try to
make my own music occasionally. I use [Ardour 7.0](https://ardour.org) for audio production
and hope to get started with the [Sonic Pi](https://sonic-pi.net) as both a standalone synth
as well as a synth for instruments I don't physically play for what
I've been working on.
